#Generated by Fabric Compiler ( version 2022.2-SP6.1 <build 138931> ) at Tue Oct 14 12:29:54 2025

add_design "D:/fpga/project/source/TOP.v"
add_design "D:/fpga/project/source/source/hex16_to_ascii.v"
add_design "D:/fpga/project/source/source/tx_real.v"
add_design "D:/fpga/pango/test_12G/source/TOP.v"
add_design "D:/fpga/pango/test_12G/source/source/hex16_to_ascii.v"
add_design "D:/fpga/pango/test_12G/source/source/tx_real.v"
remove_design -verilog "D:/fpga/pango/test_12G/source/source/tx_real.v"
remove_design -force -verilog "D:/fpga/pango/test_12G/source/source/hex16_to_ascii.v"
add_design "D:/fpga/pango/test_12G/source/key_debounve.v"
add_design "D:/fpga/pango/test_12G/source/matrix_ctrl.v"
add_design "D:/fpga/pango/test_12G/source/matrix_scan.v"
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
synthesize -synplify_pro -selected_syn_tool_opt 1 -top_module TOP
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
add_constraint "D:/fpga/pango/test_12G/project.fdc"
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design D:/fpga/pango/test_12G/ipcore/CLK_50M/CLK_50M.idf
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module TOP
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
